
const questions = {
  science: [
    { q: "سرعت نور چقدر است؟", options:["300km/s","300000km/s","10000km/s"], answer:1 },
    { q: "آب در چند درجه می‌جوشد؟", options:["80","90","100"], answer:2 }
  ],
  history: [
    { q: "کوروش کبیر بنیانگذار کدام امپراتوری بود؟", options:["روم","هخامنشی","عثمانی"], answer:1 }
  ],
  cinema: [
    { q: "کارگردان فیلم پدرخوانده؟", options:["اسکورسیزی","فورد کاپولا","اسپیلبرگ"], answer:1 }
  ],
  tv: [
    { q: "قدیمی‌ترین شبکه تلویزیونی ایران؟", options:["شبکه یک","شبکه دو","شبکه سه"], answer:0 }
  ],
  football: [
    { q: "کدام تیم بیشترین جام جهانی را دارد؟", options:["آرژانتین","آلمان","برزیل"], answer:2 }
  ],
  food: [
    { q: "کدام دسر ایرانی است؟", options:["تیرامیسو","پلمبیر","شله‌زرد"], answer:2 }
  ]
};
